
## Plan Result




<pre><code>Plan: 1 to add, 9 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_user_assigned_identity.hmi-sds-mi
* Update
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_schedule.trigger_once
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_schedule.trigger_once
  * module.kv_cft.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_crime.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_hmi.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_rota.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_snl.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_user_assigned_identity.hmi-sds-mi will be created
  + resource "azurerm_user_assigned_identity" "hmi-sds-mi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "hmi-sds-stg-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-stg-rg"
      + tenant_id           = (known after apply)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_schedule.schedule will be updated in-place
  ~ resource "azurerm_automation_schedule" "schedule" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rl-schedule"
        name                    = "rotate-sas-tokens-hmisastg-rota-rl-schedule"
      ~ start_time              = "2023-11-30T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_schedule.trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "trigger_once" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rl-schedule-single-trigger"
        name                    = "rotate-sas-tokens-hmisastg-rota-rl-schedule-single-trigger"
      ~ start_time              = "2023-11-29T13:20:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_schedule.schedule will be updated in-place
  ~ resource "azurerm_automation_schedule" "schedule" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rlw-schedule"
        name                    = "rotate-sas-tokens-hmisastg-rota-rlw-schedule"
      ~ start_time              = "2023-11-30T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_schedule.trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "trigger_once" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rlw-schedule-single-trigger"
        name                    = "rotate-sas-tokens-hmisastg-rota-rlw-schedule-single-trigger"
      ~ start_time              = "2023-11-29T13:20:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.kv_cft.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-sds-kv-stg-cft|hmi-sds-kv-stg-cft"
        name                           = "hmi-sds-kv-stg-cft"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.kv_crime.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-sds-kv-stg-crime|hmi-sds-kv-stg-crime"
        name                           = "hmi-sds-kv-stg-crime"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.kv_hmi.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-sds-kv-stg|hmi-sds-kv-stg"
        name                           = "hmi-sds-kv-stg"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.kv_rota.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-sds-kv-stg-rota|hmi-sds-kv-stg-rota"
        name                           = "hmi-sds-kv-stg-rota"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.kv_snl.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-sds-kv-stg-snl|hmi-sds-kv-stg-snl"
        name                           = "hmi-sds-kv-stg-snl"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 9 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":49,"Program":"tfcmt","SHA1":"","Vars":{}} -->